УТ_для_edt/src/InformationRegisters/CRM_СтатусыПисемEmailРассылки/CRM_СтатусыПисемEmailРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СтатусыПисемEmailРассылки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыПисемEmailРассылки</types>
    </type>
  </resources>
  <attributes>
    <name>СтатусСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_РасшифровкиСтатусовПисемEmailРассылки/CRM_РасшифровкиСтатусовПисемEmailРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_РасшифровкиСтатусовПисемEmailРассылки</name>
  <resources>
    <name>Расшифровка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>КодСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_СтатусыПисемEmailРассылки/CRM_СтатусыПисемEmailРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыПисемEmailРассылки</name>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>Отправляется</name>
  </enumValues>
  <enumValues>
    <name>Прочитано</name>
  </enumValues>
  <enumValues>
    <name>ПереходПоСсылке</name>
  </enumValues>
  <enumValues>
    <name>НеДоставлено</name>
  </enumValues>
  <enumValues>
    <name>ПолучательОтписалсяОтРассылки</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОтправки</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_СервисыРассылок/CRM_СервисыРассылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СервисыРассылок</name>
  <predefined>
    <items>
      <name>SMTP</name>
      <description>SMTP</description>
    </items>
  </predefined>
  <attributes>
    <name>ХранилищеНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Включен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартМенеджерСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочийТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТС</name>
    <comment>#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнутреннихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнешнихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТСДополнительный</name>
    <comment>//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОповещениеОбИнтересах</name>
    <comment>//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами. </comment>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Новые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершенные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запчасти</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныеМатериалы</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартКонтролируемыеМенеджеры</name>
    <comment>//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_ИнтеграцияССервисамиРассылок/Module.bsl
#Область ПрограммныйИнтерфейс

// Отправить письмо.
//
// Параметры:
//	Объект			 - СправочникОбъект.ЭлектронноеПисьмоИсходящее - отправляемое письмо. 
//  ПараметрыПисьма	 - Структура - Параметры письма. 
//  НастройкиСервиса - СправочникСсылка.CRM_СервисыРассылок - Используемый сервис рассылки.
//	ТекстОтвета		 - Строка - Текст ответа.
// 
// Возвращаемое значение:
//  Структура - Структура ответа. 
//
Функция ВыполнитьОтправкуПисьма(Объект, ПараметрыПисьма, НастройкиСервиса, ТекстОтвета) Экспорт
	
	МодульМенеджера = НастройкиСервиса.МодульМенеджера;
	Если МодульМенеджера = Неопределено Тогда
		ТекстОтвета = НСтр("ru = 'Не найдена обработка'") + " - CRM_РаботаССервисомРассылок" + НастройкиСервиса.ИмяСервиса;
		Возврат Неопределено;
	КонецЕсли;
	Возврат МодульМенеджера.ВыполнитьОтправкуПисьма(Объект, ПараметрыПисьма, НастройкиСервиса, ТекстОтвета);
	
КонецФункции
	
// Настройки сервиса рассылки
// 
// Параметры:
//  СервисРассылки - СправочникСсылка.CRM_СервисыРассылок - Используемый сервис рассылки. 
// 
// Возвращаемое значение:
//  Структура - Данные доступа.
//
Функция НастройкиСервиса(СервисРассылки) Экспорт
	ДанныеДоступа = СервисРассылки.ХранилищеНастроек.Получить();
	Если ДанныеДоступа = Неопределено Тогда
		ДанныеДоступа = Новый Структура;
	КонецЕсли;
	ДанныеДоступа.Вставить("СервисРассылки", СервисРассылки);
	ДанныеДоступа.Вставить("ИмяСервиса", СервисРассылки.ИмяСервиса);
	ДанныеДоступа.Вставить("МодульМенеджера", МодульМенеджера(СервисРассылки.ИмяСервиса));
	Возврат ДанныеДоступа;
КонецФункции
	
// Возвращает менеджер обработки для работы с сервисом.
//
// Параметры:
//	ИмяСервиса - Строка - Имя сервиса.
// 
// Возвращаемое значение:
//  ОбработкаМенеджер - менеджер обработки для работы с сервисом.
//
Функция МодульМенеджера(ИмяСервиса) Экспорт
	ИмяОбработки = "CRM_РаботаССервисомРассылок"+ИмяСервиса;
	МД = Метаданные.Обработки.Найти(ИмяОбработки);
	Если МД <> Неопределено Тогда
		Возврат Обработки[ИмяОбработки];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Возвращает статусы в доставке.
// 
// Возвращаемое значение:
//  СписокЗначений - статусы в доставке.
//
Функция СтатусыВДоставке() Экспорт
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.CRM_СтатусыПисемEmailРассылки.Отправляется);
	СписокСтатусов.Добавить(Перечисления.CRM_СтатусыПисемEmailРассылки.Отправлено);
	СписокСтатусов.Добавить(Перечисления.CRM_СтатусыПисемEmailРассылки.Доставлено);
	Возврат СписокСтатусов;
	
КонецФункции

// Обновляет статусы e-mail рассылок.
//
// Параметры:
//	СервисРассылок - СправочникСсылка.CRM_СервисыРассылок - Сервис рассылок.
//	ТаблицаПисем   - ТаблицаЗначений - Таблица писем.
//
Процедура ОбновитьСтатусыEmailРассылок(СервисРассылок, ТаблицаПисем) Экспорт
	НастройкиСервиса = НастройкиСервиса(СервисРассылок);
	НастройкиСервиса.МодульМенеджера.ОбновитьСтатусыEmailРассылок(НастройкиСервиса, ТаблицаПисем);
КонецПроцедуры
	
// Получить статус письма
//
// Параметры:
//  Письмо	 - ДокументСсылка - Ссылка на письмо.
// 
// Возвращаемое значение:
//  Структура - Структура статусов письма. 
//
Функция ПолучитьСтатусПисьма(Письмо) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СтатусыПисемEmailРассылки.Статус,
	                      |	CRM_СтатусыПисемEmailРассылки.СтатусСтрокой,
	                      |	CRM_РасшифровкиСтатусовПисемEmailРассылки.Расшифровка
	                      |ИЗ
	                      |	РегистрСведений.CRM_СтатусыПисемEmailРассылки КАК CRM_СтатусыПисемEmailРассылки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_РасшифровкиСтатусовПисемEmailРассылки КАК CRM_РасшифровкиСтатусовПисемEmailРассылки
	                      |		ПО CRM_СтатусыПисемEmailРассылки.СтатусСтрокой = CRM_РасшифровкиСтатусовПисемEmailРассылки.КодСтатуса
	                      |ГДЕ
	                      |	CRM_СтатусыПисемEmailРассылки.Письмо = &Письмо");
	Запрос.УстановитьПараметр("Письмо", Письмо);
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураСтатуса = Новый Структура;
	Если Выборка.Следующий() Тогда
		СтруктураСтатуса.Вставить("Статус", Выборка.Статус);
		СтруктураСтатуса.Вставить("СтатусСтрокой", Выборка.СтатусСтрокой);
		СтруктураСтатуса.Вставить("РасшифровкаСтатуса", Выборка.Расшифровка);
	Иначе
		СтруктураСтатуса.Вставить("Статус", Перечисления.CRM_СтатусыПисемEmailРассылки.ПустаяСсылка());
		СтруктураСтатуса.Вставить("СтатусСтрокой", "");
		СтруктураСтатуса.Вставить("РасшифровкаСтатуса", "");
	КонецЕсли;
	Возврат СтруктураСтатуса;
	
КонецФункции
	
// Массив шаблонов сервиса
//
// Параметры:
//	СервисРассылки - СправочникСсылка.CRM_СервисыРассылок - Сервис рассылки.
// 
// Возвращаемое значение:
//  Структура - Структура ответа. 
//
Функция МассивШаблоновСервиса(СервисРассылки) Экспорт
	
	НастройкиСервиса = НастройкиСервиса(СервисРассылки);
	
	Если НастройкиСервиса.МодульМенеджера = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НастройкиСервиса.МодульМенеджера.МассивШаблоновСервиса(НастройкиСервиса);
	
КонецФункции

// Шаблон uni sender
//
// Параметры:
//	СервисРассылки - СправочникСсылка.CRM_СервисыРассылок - Сервис рассылки.
//  Шаблон	 - Строка - ИД шаблона. 
// 
// Возвращаемое значение:
//  Структура - Структура ответа.
//
Функция ШаблонСервиса(СервисРассылки, Шаблон) Экспорт
	
	НастройкиСервиса = НастройкиСервиса(СервисРассылки);
	Возврат НастройкиСервиса.МодульМенеджера.ШаблонСервиса(НастройкиСервиса, Шаблон);
	
КонецФункции

// Подписать получателя на рассылки
//
// Параметры:
//  Объект		 - СправочникОбъект	 - Передаваемый объект. 
//  Подписать	 - Булево	 -  Признак подписи.
//  Отказ		 - Булево	 -  Признак отказа.
//
Процедура ПодписатьПолучателяНаРассылки(Объект, Подписать = Истина, Отказ) Экспорт
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица));
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Партнеры") Тогда
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailПартнера));
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Пользователи") Тогда
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailПользователя));
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица));
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		Строки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента));	
	КонецЕсли;
	Если Строки.Количество() > 0 Тогда
		Для каждого Строка Из Строки Цикл
			Если Подписать Тогда
				Если НЕ ПодписатьАдресНаРассылки(Строка.АдресЭП) Тогда
					Отказ = Истина;
				КонецЕсли;
			Иначе
				Если НЕ ОтписатьАдресОтРассылки(Строка.АдресЭП) Тогда
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПодписатьАдресНаРассылки(email)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СервисыРассылок.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СервисыРассылок КАК CRM_СервисыРассылок
	                      |ГДЕ
	                      |	НЕ CRM_СервисыРассылок.ПометкаУдаления
	                      |	И НЕ CRM_СервисыРассылок.Предопределенный");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Истина;
	Пока Выборка.Следующий() Цикл
		НастройкиСервиса = НастройкиСервиса(Выборка.Ссылка);
		Результат = Результат И НастройкиСервиса.МодульМенеджера.ПодписатьАдресНаРассылки(НастройкиСервиса, email);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция ОтписатьАдресОтРассылки(email)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СервисыРассылок.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СервисыРассылок КАК CRM_СервисыРассылок
	                      |ГДЕ
	                      |	НЕ CRM_СервисыРассылок.ПометкаУдаления
	                      |	И НЕ CRM_СервисыРассылок.Предопределенный");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Истина;
	Пока Выборка.Следующий() Цикл
		НастройкиСервиса = НастройкиСервиса(Выборка.Ссылка);
		Результат = Результат И НастройкиСервиса.МодульМенеджера.ОтписатьАдресОтРассылки(НастройкиСервиса, email);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Проверяет адрес учетной записи.
//
// Параметры:
//	СервисРассылки - СправочникСсылка.CRM_СервисыРассылок - Сервис рассылки.
//  email		   - Строка - Строка с email адресом.
// 
// Возвращаемое значение:
//  Булево - Существование адреса. 
//
Функция ПроверитьАдресУчетнойЗаписи(СервисРассылки, email) Экспорт
	
	НастройкиСервиса = НастройкиСервиса(СервисРассылки);
	Возврат НастройкиСервиса.МодульМенеджера.ПроверитьАдресУчетнойЗаписи(НастройкиСервиса, email);
	
КонецФункции

// Возвращает адреса электронной почты в контактной информации.
//
// Параметры:
//	МассивАдресов - Массив - адреса электронной почты.
// 
// Возвращаемое значение:
//  Соответствие - Соответствие контактов и адресов электронной почты. 
//
Функция НайтиАдресаЭлектроннойПочтыВКонтактнойИнформации(МассивАдресов) Экспорт

	СоответствиеКонтактов = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контакты.Ссылка,
	|	Контакты.АдресЭП КАК АдресЭП
	|ИЗ
	|	(ВЫБРАТЬ
	|		КонтактнаяИнформация.Ссылка КАК Ссылка,
	|		КонтактнаяИнформация.АдресЭП КАК АдресЭП
	|	ИЗ
	|		Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформация
	|	ГДЕ
	|		КонтактнаяИнформация.АдресЭП В(&МассивАдресов)
	|		И КонтактнаяИнформация.Тип = &Тип
	|		И НЕ(КонтактнаяИнформация.Ссылка.ПометкаУдаления)
	|";
	
	МассивОписанияТиповКонтактов = ВзаимодействияКлиентСервер.ОписанияКонтактов();
	Для каждого ЭлементМассиваОписания Из МассивОписанияТиповКонтактов Цикл
		
		Если ЭлементМассиваОписания.Имя = "Пользователи" Тогда
			Продолжить;
		КонецЕсли;	
		
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|		КонтактнаяИнформация.Ссылка КАК Ссылка,
		|		КонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ИЗ
		|	Справочник." + ЭлементМассиваОписания.Имя + ".КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.АдресЭП В(&МассивАдресов)
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И (НЕ КонтактнаяИнформация.Ссылка.ПометкаУдаления)
		|";
		
	КонецЦикла;	
	
	Запрос.Текст = Запрос.Текст + ") КАК Контакты
	|ИТОГИ ПО
	|	АдресЭП";

	Запрос.УстановитьПараметр("МассивАдресов", МассивАдресов);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ВыборкаПоСсылкам = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если (ВыборкаПоСсылкам.Следующий()) Тогда
			СоответствиеКонтактов.Вставить(ВРег(Выборка.АдресЭП), ВыборкаПоСсылкам.Ссылка);
		КонецЕсли;
	КонецЦикла;

	Возврат СоответствиеКонтактов;

КонецФункции

// Получить картинку мессенджера.
//
// Параметры:
//	СервисРассылки - СправочникСсылка.CRM_СервисыРассылок - Сервис рассылки.
//	ИмяМакета	   - Строка - Имя макета.
//
// Возвращаемое значение:
//  Картинка - картинка мессенджера.
//
Функция КартинкаСервиса(СервисРассылки, ИмяМакета = "Иконка_16") Экспорт
	
	МодульМенеджера = МодульМенеджера(СервисРассылки.ИмяСервиса);
	Если МодульМенеджера = Неопределено Тогда
		ТекстОтвета = НСтр("ru = 'Не найдена обработка'") + " - CRM_РаботаССервисомРассылок" + СервисРассылки.ИмяСервиса;
		Возврат Неопределено;
	КонецЕсли;
	ДанныеКартинки = МодульМенеджера.ПолучитьМакет(ИмяМакета);
	Картинка = Новый Картинка(ДанныеКартинки);
	Возврат Картинка;
	
КонецФункции

// Возвращает текст заголовка.
//
// Параметры:
//	ИмяСервиса - Строка - Имя сервиса.
// 
// Возвращаемое значение:
//  Строка - текст заголовка.
//
Функция ТекстЗаголовка(ИмяСервиса) Экспорт
	МодульМенеджера = МодульМенеджера(ИмяСервиса);
	Если МодульМенеджера = Неопределено Тогда
		ТекстОтвета = НСтр("ru = 'Не найдена обработка'") + " - CRM_РаботаССервисомРассылок" + ИмяСервиса;
		Возврат Неопределено;
	КонецЕсли;
	Макет = МодульМенеджера.ПолучитьМакет("МакетФорматированнойСтроки");
	Заголовок = Макет.ПолучитьОбласть("Заголовок").ТекущаяОбласть.Текст;
	Возврат Заголовок;
КонецФункции

// Получить список сервисов
//
// Параметры:
//	РазмерИконки - Строка - Размер иконки.
// 
// Возвращаемое значение:
//  СписокЗначений - Список сервисов.
//
Функция ПолучитьСписокСервисов(РазмерИконки = 16) Экспорт
	СписокМессенджеров = Новый СписокЗначений;
	Для каждого Обработка Из Метаданные.Обработки Цикл
		Если СтрНайти(Обработка.Имя, "CRM_РаботаССервисомРассылок") = 1 Тогда
			ТипМессенджера = СтрЗаменить(Обработка.Имя, "CRM_РаботаССервисомРассылок", "");
			Если Обработка.Макеты.Найти("Иконка_"+Строка(РазмерИконки)) <> Неопределено Тогда
				МакетКартинки = Обработки[Обработка.Имя].ПолучитьМакет("Иконка_"+Строка(РазмерИконки));
				Картинка = Новый Картинка(МакетКартинки);
			Иначе
				Картинка = Неопределено;
			КонецЕсли;
			СписокМессенджеров.Добавить(ТипМессенджера,,, Картинка);
		КонецЕсли;
	КонецЦикла;
	Возврат СписокМессенджеров;
КонецФункции

// Возвращает сервис рассылки по умолчанию.
//
// Возвращаемое значение:
//	СправочникСсылка.CRM_СервисыРассылок - сервис рассылки по умолчанию.
//
Функция СервисРассылкиПоУмолчанию() Экспорт
	
	Сервис = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("СервисРассылки");
	Если НЕ ЗначениеЗаполнено(Сервис) ИЛИ (НЕ Сервис.Включен) ИЛИ Сервис.ПометкаУдаления Тогда
		Сервис = Константы.CRM_СервисРассылокПоУмолчанию.Получить();
		Если НЕ ЗначениеЗаполнено(Сервис) ИЛИ (НЕ Сервис.Включен) ИЛИ Сервис.ПометкаУдаления Тогда
			Сервис = Справочники.CRM_СервисыРассылок.SMTP;
		КонецЕсли;
	КонецЕсли;
	Возврат Сервис;
	
КонецФункции

#КонецОбласти
